"{\"title\": \"ARCHITECTURAL DESIGN IV - BUILDING ENERGY SIMULATION\", \"level\": \"3020\", \"abbreviation\": \"AREN\", \"description\": \"This course aims to develop an understanding of sustainability in architecture and introduces the fundamentals and applications of energy simulation tools. Studio: The studio component of the course will explore the relationships between people, buildings, and the environment. Students will explore the impact of building site and context, orientation, building massing and envelop configuration, occupancy and other factors. Students will engage these topics through architectural design studies and simulations for a project of increased scope and programmatic complexity. Modeling and visualization software, simulation tools, orthographic drawings, and physical models are used to explore and develop architectural design concepts. Lectures: The lecture components of the course focuses on the principles of building energy simulation, with a focus on the practical applications of building energy simulation tools to building design. Topics being covered include various model input parameters such as building geometry, orientation, climate, comfort, zoning, material properties, operation schedules, and HVAC systems. Building energy simulation software is illustrated and applied to the analysis of case studies and/or design projects. Simulation output results are critically analyzed and compared to the results obtained from other building energy calculation methods. \\nThis course uses studio and lecture based teaching methods \\nRecommended background: Building Physics and HVAC system design (AREN 3024 and AREN 3003) and Architectural Design (AREN 2002, AREN 2004, and AREN 3002 or equivalent). \\nStudents may not receive credit for both AREN 3020 and AREN 3025\", \"req\": [[[\"AREN\"], [\"3024\"]], [[\"AREN\"], [\"3003\"]], [[\"AREN\"], [\"2002\"]], [[\"AREN\"], [\"2004\"]], [[\"AREN\"], [\"3002\"]], [[\"AREN\"], [\"3020\"]], [[\"AREN\"], [\"3025\"]]], \"cat1Status\": true, \"startYear\": -1}"