{"title": "INTRODUCTION TO DIGITAL CIRCUIT DESIGN", "level": "2029", "abbreviation": "ECE", "description": "Cat. I\n \nDigital circuits are the foundation upon which the computers, cell phones, and\ncalculators we use every day are built. This course explores these foundations by \nusing modern digital design techniques to design, implement and test digital\n circuits ranging in complexity from basic logic gates to state machines that \nperform useful functions like calculations, counting, timing, and a host of other\n applications. Students will learn modern design techniques, using a hardware\n description language (HDL) such as Verilog to design, simulate and implement \nlogic systems consisting of basic gates, adders, multiplexers, latches, and\n counters. The function and operation of programmable logic devices, such as \nfield programmable gate arrays (FPGAs), will be described and discussed in\n terms of how an HDL logic design is mapped and implemented. Experiments\n involving the design of combinational and sequential circuits will provide \nstudents a hands-on introduction to basic digital electrical engineering concepts\n and the skills needed to gain more advanced skills. In the laboratory, students \nwill construct, troubleshoot, and test the digital circuits that they have developed \nusing a hardware description language. These custom logic designs will be \nimplemented using FPGAs and validated using test equipment.\n Topics: Number representations, Boolean algebra, design and simplification of\ncombinational circuits, arithmetic circuits, analysis and design of sequential \ncircuits, and synchronous state machines.\n Lab exercises: Design, analysis and construction of combinational and \nsequential circuits; use of hardware description languages to implement, test,\nand verify digital circuits; function and operation of FPGAs. \n\nRecommended background: Introductory Electrical and Computer\n Engineering concepts covered in a course such as ECE 2010 or RBE 1001, and\n MA 1022. \n\nNote: Students will not be able to receive credit for both ECE 2022 and\n ECE 2029.", "req": [[["ECE"], ["2010"]], [["RBE"], ["1001"]], [["MA"], ["1022"]], [["ECE"], ["2022"]], [["ECE"], ["2029"]]], "cat1Status": true, "startYear": -1}