{"title": "PROTECTIVE RELAYING", "level": "5521", "abbreviation": "ECE", "description": "This graduate level course is the first of a two course sequence that covers both the principles and practices of power system protective relaying. The course seeks to provide an understanding of how interconnected power systems and their components are protected from abnormal events such as faults (short circuits), over-voltages, off-nominal frequency and unbalanced phase conditions.  This subject is presented from a theoretical viewpoint, however, many practical examples are included that emphasize the limitations of existing protective equipment.  Course content is not specific to any particular manufacturer’s equipment. The course begins with a brief review of the nature of power system operation, power system faults and other abnormal conditions.  The nature and objectives of protective relaying are covered next with emphasis on how the power system can be monitored to detect abnormal conditions. The computational tools needed to analyze system operation and apply protective relaying are covered next, including the per-unit system, phasors and symmetrical components.  The modeling of current transformers under steady-state and transient conditions is presented with emphasis on the impact on protective devices.  A unit on system grounding and its impact on protective device operation is included.  Course emphasis then shifts to protective devices and their principles of operation.  Both electromechanical and numeric relay designs are covered. (Prerequisite:  ECE 5500 Power System Analysis or equivalent background experience is suggested. Familiarity with phasors, derivatives, transfer functions, poles and zeros, block diagram and the notion of feedback with basic understanding power system analysis or similar background is recommended.  Note: Credit cannot be awarded for this course if credit has already been received for ECE 5520 Power System Protection and Control.)", "req": [], "cat1Status": true, "startYear": -1}