{"title": "EMBEDDED COMPUTING IN ENGINEERING DESIGN", "level": "2049", "abbreviation": "ECE", "description": "Cat. I\n \nEmbedded computers are literally everywhere in modern life. On any given day \nwe interact with and depend on dozens of small computers to make coffee, run\n cell phones, take pictures, play music, control elevators, manage the\n emissions and antilock brakes in our automobile, control a home security\n system, and so on. Using popular everyday devices as case studies, students in \nthis course are introduced to the unique computing and design challenges posed\n by embedded systems. Students will then solve real-world design problems using\n small, resource constrained (time/memory/power) computing platforms. The\nhardware and software structure of modern embedded devices and basic\ninteractions between embedded computers and the physical world will also be \ncovered in lecture and as part of laboratory experiments. In the laboratory, \nemphasis is placed on interfacing embedded processors with common sensors \nand devices (e.g. temperature sensors, keypads, LCD display, SPI ports, pulse \nwidth modulated motor controller outputs) while developing the skills needed \nto use embedded processors in systems design. This course is also appropriate for\n RBE and other engineering and CS students interested in learning about\n embedded system theory and design.\n Topics: Number/data representations, embedded system design using C, \nmicroprocessor and microcontroller architecture, program development and \ndebugging tools for a small target processor, hardware/software dependencies, \nuse of memory mapped peripherals, design of event driven software, time and \nresource management, applications case studies.\n Lab Exercises: Students will solve commonly encountered embedded \nprocessing problems to implement useful systems. Starting with a requirements\n list students will use the knowledge gained during the lectures to implement\n solutions to problems which explore topics such as user interfaces and\n interfacing with the physical world, logic flow, and timing and time constrained\n programming. Exercises will be performed on microcontroller and/or\n microprocessor based embedded systems using cross platform development tools\nappropriate to the target platform.\n \nRecommended Background: ECE 2010 or equivalent knowledge in basic \ncircuits, devices and analysis; and C language programming (CS 2301 or\n equivalent)\n \nSuggested Background: ECE 2029 or equivalent knowledge of digital logic, \nlogic signals and logic operations; \n\nNote: Students who have received credit for ECE 2801 may not receive \ncredit for ECE 2049.", "req": [], "cat1Status": true, "startYear": -1}