"{\"Course Name\": \"DEVELOPMENT ECONOMICS\", \"Course Level\": \"2125\", \"Dept Abbreviation\": \"ECON\", \"Course Description\": \"Cat. II\\nThis course is a general introduction to the field of development economics. The\\nfocus is on ways in which a developing country can increase its productive \\ncapacity, both agricultural and industrial, in order to achieve sustained economic\\n growth. The course proceeds by first examining how economic growth and \\neconomic development are measured and how the various nations of the world\\n compare according to well-known social and economic indicators. Theories of \\neconomic growth and theories of economic development are then examined, as \\nare the various social and cultural structures that are thought to influence \\neconomic progress. The inputs to economic growth and development (land,\\n labor, capital, entrepreneurial ability, education, technical change), and the\\n possible distributions of income and levels of employment that result from their\\nuse, is considered next. Domestic economic problems and policies such as \\ndevelopment planning, the choice of sectorial policies, the choice of monetary \\nand fiscal policies, rapid population growth, and urbanization and urban\\n economic development are then examined. The course concludes with a\\n consideration of international problems and policies such as import substitution\\n and export promotion, foreign debt, foreign investment, and the role of \\ninternational firms. In conjunction with a traditional presentation of the above \\ntopics, the course curriculum will include the use of computer simulation \\nmodels and games. These materials have been formulated with a simulation\\ntechnique, system dynamics, that has its origins in control engineering and the \\ntheory of servomechanisms. As a result, students will find them complementary \\nto their work in engineering and science. In addition, the various development theories and simulation and gaming results will be related, where possible, to specific developing nations where WPI has on-going project activities (e.g., Costa Rica and Thailand). This course is recommended for those students\\n wishing to do an IQP or MQP in a developing nation.\\n     Recommended background: ECON 1120.\\nThis course will be offered in 2015-16, and in alternating years thereafter.\", \"Requirements\": [[[\"ECON\"], [\"1120\"]]], \"Is Cat 1\": false, \"Start Year For Cat 2\": \"2015\"}"