"{\"Course Name\": \"NUMBERS, POLYNOMIALS AND ALGEBRAIC STRUCTURES\", \"Course Level\": \"529\", \"Dept Abbreviation\": \"MME\", \"Course Description\": \"This course enables secondary mathematics \\nteachers to see how commonly taught topics \\nsuch as number systems and polynomials fit into \\nthe broader context of algebra. The course will \\nbegin with treatment of arithmetic, working\\n through Euclid\\u2019s algorithm and its applications,\\n the fundamental theorem of arithmetic and\\n its applications, multiplicative functions, the\\n Chinese remainder theorem and the arithmetic\\nof Z/n. This information will be carried over\\n to polynomials in one variable over the rational\\nand real numbers, culminating in the construction\\n of root fields for polynomials via quotients\\n of polynomial rings. Arithmetic in the Gaussian \\nintegers and the integers in various other quadratic \\nfields (especially the field of cube roots of unity) \\nwill be explored through applications such as the\\n generation of Pythagorean triples and solutions to\\n other Diophantine equations (like finding integer-sided\\n triangles with a 60 degree angle). The course \\nwill then explore cyclotomy, and the arithmetic in \\nrings of cyclotomic integers. This will culminate \\nin Gauss\\u2019s construction of the regular 5-gon and\\n 17-gon and the impossibility of constructing a\\n 9-gon or trisecting a 60-degree angle. Finally,\\n solutions of cubics and quartics by radicals will be \\nstudied. All topics will be based on the analysis of \\nexplicit calculations with (generalized) numbers.\\n The proposed curriculum covers topics that are\\n part of the folklore for high school mathematics \\n(the impossibility of certain ruler and compass\\n constructions), but that many teachers know only\\n as facts. There are also many applications of the \\nideas that will allow the teachers to use results and \\nideas from abstract algebra to construct for their \\nstudents problems that have manageable solutions.\", \"Requirements\": [], \"Is Cat 1\": true, \"Start Year For Cat 2\": -1}"